Revit 2027 API
ExternalResourceBrowserData.ServerId Property
 The Id of IExternalResourceServer which handles the external resource load.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Guid ServerId { get; }
Public ReadOnly Property ServerId As Guid
	Get
public:
property Guid ServerId {
	Guid get ();
}
member ServerId : Guid with get
Property Value
Guid
See Also
Reference
ExternalResourceBrowserData Class
Autodesk.Revit.DB Namespace